[
    {
        "name": "La Palma VolTrac",
        "icon": "icon.webp",
        "category": "Education",
        "carousel_assets": [
            "https://youtu.be/998mcVryYwU?si=TAqXRhfi8m9q7GoN",
            "1.webp",
            "2.webp",
            "3.webp",
            "4.webp",
            "5.webp",
            "6.webp",
            "7.webp",
            "8.webp"
        ],
        "base_url": "./apps/La_Palma_VolTrac/",
        "file": "/app/La Palma Volcano Tracking Tool_1.0.0.apk",
        "pwa_link": "",
        "type": "app",
        "date": "Dec 29, 2022",
        "android_OS": "6.0+",
        "version": "1.0.0",
        "content": "Volcanic Activities of La Palma visualized onto the Liquid Galaxy.\nLa Palma Volcano Eruption Tracking Tool is an app built on the Flutter framework that allows the Visualization of various Tracks, such as Historic, Lava Flow, Affected Areas, Pre-historic, Landscape, Sulphur Dioxide Emissions, Situation, and Located Events map, for La Palmas onto the Liquid Galaxy.\nThe project presents multiple layers of information on the events that occurred in the eruption of the Cumbre Vieja volcano in La Palma during the fall of 2021.\nData such as the evolution of lava flows and many more are presented in a graphical and interactive way on the Liquid Galaxy platform, a visualization cluster based on Google Earth.\nFurther customizations are possible with the help of the Custom Builder, which has an interactive UX where the user can check the data he wants and visualize the Custom KML by providing start and end dates with the help of a calendar widget.\nThe Map screen UI is a perfect interaction tool for the panoramic display of Google Earth with the help of Google Maps, and it allows us to control the LG and send Orbit movements and various other controls.\nThe app shows essential information about the La Palma Volcanic activity in an elegant and user-friendly way.\nIt supports 10 Languages: Arabic, German, English, Spanish, Hindi, Japanese, Portuguese, Russian, Albanian, and Chinese (Simplified).\nThe app comes in both day and night modes, and one can 'tour' the app to get familiar with all the features.\nLastly, the app has an info tab that lists helpful information along with the sources so that one can use this app for research and education purposes.\n\nThis project has been started as a Google Summer of Code 2022 project with the Liquid Galaxy Organization, developed by\nYash Raj Bharti.\nLleida Liquid Galaxy LAB support: Pau Francino\nLiquid Galaxy Org Director: Andreu Ibañez\nApp released by Alejandro Illán Marcos"
    },
    {
        "name": "SatNOGS Visualization Tool",
        "icon": "icon.webp",
        "category": "Education",
        "carousel_assets": [
            "1.webp",
            "2.webp",
            "3.webp",
            "4.webp",
            "5.webp"
        ],
        "base_url": "./apps/SatNOGS_Visualization_Tool/",
        "file": "/app/SatNOGS Visualization Tool_1.0.5.apk",
        "pwa_link": "",
        "type": "app",
        "date": "Mar 28, 2024",
        "android_OS": "4.4W+",
        "version": "1.0.5",
        "content": "View satellites and ground stations information from the SatNOGS database.\nThe project aims to collect and show data from satellites and ground stations using the SatNOGS database and API.\nWith the data available into the app, is possible to send it to the Liquid Galaxy system to be shown into Google Earth.\nAll this information is included in the SatNOGS (Satellite Networked Open Ground Station) database.\nThe ground stations are antennas that capture transmissions from satellites. Using this network, SatNOGS created a database with all the information captured since its creation. We will use this database to get the information we need, since it is open and free. It contains information about the satellites, the data received in the communication, the protocols of transmission accepted and more.\nAn important step to take is configure the slave screens for refreshing, otherwise the logos and the info balloon will not be visible. Follow the steps below to activate it:\n1. With Google Earth opened, press CTRL+ALT+B on the keyboard or click on the VIEW tab on the tab bar and then Sidebar.\n2. Into the Sidebar, expand the KML Sync folder.\n3. Right click on the Solo KML folder and click on Properties.\n4. Go to the Refresh tab and change the Time-Based Refresh to: Periodically | 0hrs | 0mins | 2secs\n- The recommended secs if from 1 to 3 seconds.\n- Click on OK and close the side bar by following the first step.\n\nDone! Remember to do it for all slave screens so all of them will be reactive.\n\nThis project has been started as a Google Summer of Code 2022 project with the Liquid Galaxy Organization, developed by Michel Agarra Barros.\nLleida Liquid Galaxy LAB support: Pau Francino\nLiquid Galaxy Org Director: Andreu Ibañez\nApp released by Alejandro Illán Marcos"
    },
    {
        "name": "Liquid Galaxy Controller",
        "icon": "icon.webp",
        "category": "Maps & Navigation",
        "carousel_assets": [
            "1.webp",
            "2.webp",
            "3.webp",
            "4.webp",
            "5.webp",
            "6.webp",
            "7.webp",
            "8.webp"
        ],
        "base_url": "./apps/Liquid_Galaxy_Controller/",
        "file": "/app/Liquid Galaxy Controller_1.2.3.apk",
        "pwa_link": "",
        "type": "app",
        "date": "Sep 8, 2017",
        "android_OS": "4.4+",
        "version": "1.2.3",
        "content": "This app controls a Liquid Galaxy Installation.\nIt's an Android app that lets the user connect to one Liquid Galaxy system and send POIs and Tours. At the same time, the app also lets to create, update and delete POIs, Tours and Categories as well as launch external applications located in a external server."
    },
    {
        "name": "Laser Slides 2024",
        "icon": "icon.webp",
        "category": "Tools",
        "carousel_assets": [
            "1.webp",
            "2.webp",
            "3.webp",
            "4.webp",
            "5.webp",
            "6.webp"
        ],
        "base_url": "./apps/Laser_Slides_2024/",
        "file": "/app/LaserSlides_0.1.0.apk",
        "pwa_link": "",
        "type": "app",
        "date": "Jun 17, 2024",
        "android_OS": "5.0+",
        "version": "0.1.0",
        "content": "Laser Slides is an app for tablet control of BEYOND laser slides via OSC.\nComplete Description -\nIntroduction: Laser Slides is a simple yet powerful cross-platform application which works with OSC (Open Sound Control), and allows users to manipulate the laser slides in the BEYOND software from a tablet device.\nGetting Started: The application is compatible with all the latest android versions starting from v4.4. The laser slides application can be best viewed in Tablet devices with a minimum screen size of 8” inches.\nInstructions:\n-- Firstly, in order to use the laser slides application the system should have BEYOND software installed in the system.\n-- On the BEYOND application we must go to the “setting” -> “OSC” -> “OSC settings” and then look up for the IP address such as “192.168.29.219”.\n-- Once we know the IP address, start the laser slides application on a tablet device. We should configure the settings to control the slides in BEYOND software.\n-- Now go to settings in the application enter the IP address and PORT as “8000”, After entering the values in the fields click on the “Save” button, if you see a popup with message “Connection Successful” you are good to go!!.\n-- Now that we have made a successful connection with BEYOND, Go to the “Home” section in the app. Here you can control the slides with various buttons and customize with your desired functionality as well.\n-- The Slides are generally manipulated using OSC commands, which you can assign to each button on “double tapping” on any button.\n-- You can see a popup on your screen by double tapping on any button. The popup has various fields, Here enter the desired button name, and the OSC command such as “0 1” or “0 3” etc. once entered click on save button and the settings will be saved.\n-- The initial digit in the OSC command represents the row number and the second number represents the cell number in that row.\nAll the OSC commands can be found at : OSC command\nUI UX: On the start up of the laser slides application we could see an on-boading page with a quick introduction of the application. In the home page we could see 3 navigation buttons, “Home” directing to the buttons page, “About”button directing to the instructions page and “settings” page which will lead to opening of a bottom sheet to configure the settings of the application. The home page has buttons to manipulate the slides, the buttons are designed to showcase a 3d button press animation. On double tapping on any button it leads to opening of a popup with HERO animation enabling the user to edit the button.\nNote - The Application does not have any user on boarding process such as registration."
    },
    {
        "name": "Rocket Launcher",
        "icon": "icon.webp",
        "category": "Education",
        "carousel_assets": [
            "1.webp",
            "2.webp",
            "3.webp",
            "4.webp",
            "5.webp",
            "6.webp",
            "7.webp"
        ],
        "base_url": "./apps/Rocket_Launcher/",
        "file": "/app/Rocket Launcher App_1.0.0.apk",
        "pwa_link": "",
        "type": "app",
        "date": "May 24, 2024",
        "android_OS": "7.1+",
        "version": "1.0.0",
        "content": "SpaceX API is used for data of all launch, starlink then visualises it on LG Rig.\nThis application harnesses the SpaceX API to access comprehensive data pertaining to all SpaceX launches, missions, and Starlink satellites deployments.\nIt serves the purpose of visualizing this data on a Liquid Galaxy Rig, effectively utilizing KML (Keyhole Markup Language) balloons to provide detailed information in a visually appealing manner.\nFurthermore, it offers real-time tracking of Starlink satellites, furnishing users with the latest positional information.\nThe development of this application represents a significant milestone achieved under the Google Summer of Code 2023 project, a collaborative initiative with the esteemed Liquid Galaxy organization.\nBy adopting the Flutter framework, the application seamlessly integrates a modern, cross-platform user interface.\nThe core functionality of this application is twofold:\n1. **SpaceX Data Visualization:**\n- **Launch Data:** The application retrieves and visualizes data on all SpaceX launches, including key details such as launch dates, payloads, and launch sites.\n- **Mission Information:** It also offers insights into various SpaceX missions, showcasing mission objectives, destinations, and progress.\n- **Starlink Satellites:** Data pertaining to Starlink satellite deployments, including orbital parameters, constellation status, and launch history, is elegantly presented.\n2. **Liquid Galaxy Integration:**\n- **KML Balloons:** Utilizing KML balloons, the application generates immersive visual representations of SpaceX data. These balloons display relevant information in a manner that enhances user understanding and engagement.\n- **Real-time Satellite Tracking:** A particularly noteworthy feature is the real-time tracking of Starlink satellites.\nUsers can monitor the precise location of these satellites as they traverse the Earth's orbit, thus gaining insight into the dynamic nature of satellite constellations.\n- **SSH Connectivity:** The application employs a secure SSH client to establish a connection with the Liquid Galaxy Rig.\nThis connection facilitates seamless data transfer and control, enabling users to interact with the Liquid Galaxy display effortlessly.\nBy leveraging the Flutter framework, the application ensures cross-device compatibility, thereby extending its reach to a broad spectrum of users.\nIts user-friendly interface enhances accessibility, making it an invaluable tool for space enthusiasts, researchers, and anyone interested in the SpaceX program.\nIn conclusion, this application represents a noteworthy achievement in the realm of space data visualization and interaction.\nIts successful development during the Google Summer of Code 2023 project for Liquid Galaxy reflects a commitment to innovation and technological advancement, furthering our understanding of SpaceX missions and Starlink satellite deployments while providing a seamless user experience on the Liquid Galaxy Rig.\n**Additional Info regarding data:**\nThis app only asks for credentials required to connect to LG and stores it locally using shared preferences along with selected theme data and language."
    },
    {
        "name": "BYOP",
        "icon": "icon.webp",
        "category": "Auto & Vehicles",
        "carousel_assets": [
            "1.webp",
            "2.webp",
            "3.webp",
            "4.webp",
            "5.webp",
            "6.webp",
            "7.webp",
            "8.webp"
        ],
        "base_url": "./apps/BYOP/",
        "file": "/app/BYOP_1.0.1.apk",
        "pwa_link": "",
        "type": "app",
        "date": "August 25, 2016",
        "android_OS": "4.4+",
        "version": "1.0.1",
        "content": "Bring Your Own Pois\nThis app allows to create lists of POIS stored as drive documents and let the user to upload any URL of this Drive documents to a Physical Web Beacon."
    },
    {
        "name": "Simple CMS",
        "icon": "icon.webp",
        "category": "Maps & Navigation",
        "carousel_assets": [
            "1.webp",
            "2.webp",
            "3.webp",
            "4.webp",
            "5.webp",
            "6.webp",
            "7.webp",
            "8.webp"
        ],
        "base_url": "./apps/Simple_CMS/",
        "file": "/app/Simple CMS_1.0.apk",
        "pwa_link": "",
        "type": "app",
        "date": "Jul 26, 2021",
        "android_OS": "8.0+",
        "version": "1.0",
        "content": "Simple CMS is a storyboards creation and management system for Liquid Galaxy.\nSimple CMS is a content management system for the creation and administration of storyboards in Liquid Galaxy, developed as part of Google Summer of Code 2020 by Diego Riveros, with Andreu Ibañez as mentor, and Marc Capdevila and Moisés Martínez as co-mentors.\nThe project Simple CMS is an android application that allows the creation of a storyboard with the following functionalities, that are going to be shown in the Liquid Galaxy:\n1. Location. Add a position.\n2. Movements. Add a movement or orbit.\n3. Balloon. Add a text, image and a video.\n4. Shape. Add two or more points that will make a shape. Also, it has an extrude option, that will fill up the space of the point to the ground.\nAfter creating a storyboard is feasible to save it locally or in google drive. Also, it is possible to import a storyboard from google drive.\nIt is important to mention that saving and importing storyboards are only available if you are logged in the application.\nOn the other hand, Simple CMS downloads community names, city, country and location of the different Google Developers community at Meetup.com.\nFinally, It is possible to do a tour of all the google developers community around the world."
    },
    {
        "name": "Liquid Galaxy For Education",
        "icon": "icon.webp",
        "category": "Education",
        "carousel_assets": [
            "1.webp",
            "2.webp",
            "3.webp",
            "4.webp",
            "5.webp",
            "6.webp",
            "7.webp"
        ],
        "base_url": "./apps/Liquid_Galaxy_For_Education/",
        "file": "/app/Liquid Galaxy For Education_1.7.apk",
        "pwa_link": "",
        "type": "app",
        "date": "Dec 28, 2019",
        "android_OS": "4.3+",
        "version": "1.7.0",
        "content": "Liquid Galaxy for Education is a project which consists of bringing Liquid Galaxy to children by using Chromebooks as screens and a tablet as a controller. \nBy that this project aims to introduce children the benefits of Liquid Galaxy and a completely new learning method for subjects like Geography and History. \nThis application was originally started at 2018 by Aleks Samuilov, Albert Planes, Oscar Carrasco, Deniz and Ivan. \nIt has much more features that brings games to students. It has been continued and developed during GSOC 2019. \nSpecial thanks to Adrià Salamero, Blai Domingo, Eloi Palau, Marian Ionuts, Taha Skaf, Roger and Andrea for helping me to create content for the game."
    }
]
