[
    {
        "name": "La Palma VolTrac",
        "icon": "icon.webp",
        "category": "Education",
        "carousel_assets": [
            "https://youtu.be/998mcVryYwU?si=TAqXRhfi8m9q7GoN",
            "1.webp",
            "2.webp",
            "3.webp",
            "4.webp",
            "5.webp",
            "6.webp",
            "7.webp",
            "8.webp"
        ],
        "base_url": "./apps/La_Palma_VolTrac/",
        "file": "/app/La Palma Volcano Tracking Tool_1.0.0.apk",
        "pwa_link": "",
        "type": "app",
        "date": "Dec 29, 2022",
        "android_OS": "6.0+",
        "version": "1.0.0",
        "content": "Volcanic Activities of La Palma visualized onto the Liquid Galaxy.\nLa Palma Volcano Eruption Tracking Tool is an app built on the Flutter framework that allows the Visualization of various Tracks, such as Historic, Lava Flow, Affected Areas, Pre-historic, Landscape, Sulphur Dioxide Emissions, Situation, and Located Events map, for La Palmas onto the Liquid Galaxy.\nThe project presents multiple layers of information on the events that occurred in the eruption of the Cumbre Vieja volcano in La Palma during the fall of 2021.\nData such as the evolution of lava flows and many more are presented in a graphical and interactive way on the Liquid Galaxy platform, a visualization cluster based on Google Earth.\nFurther customizations are possible with the help of the Custom Builder, which has an interactive UX where the user can check the data he wants and visualize the Custom KML by providing start and end dates with the help of a calendar widget.\nThe Map screen UI is a perfect interaction tool for the panoramic display of Google Earth with the help of Google Maps, and it allows us to control the LG and send Orbit movements and various other controls.\nThe app shows essential information about the La Palma Volcanic activity in an elegant and user-friendly way.\nIt supports 10 Languages: Arabic, German, English, Spanish, Hindi, Japanese, Portuguese, Russian, Albanian, and Chinese (Simplified).\nThe app comes in both day and night modes, and one can 'tour' the app to get familiar with all the features.\nLastly, the app has an info tab that lists helpful information along with the sources so that one can use this app for research and education purposes.\n\nThis project has been started as a Google Summer of Code 2022 project with the Liquid Galaxy Organization, developed by\nYash Raj Bharti.\nLleida Liquid Galaxy LAB support: Pau Francino\nLiquid Galaxy Org Director: Andreu Iba침ez\nApp released by Alejandro Ill치n Marcos"
    },
    {
        "name": "SatNOGS Visualization Tool",
        "icon": "icon.webp",
        "category": "Education",
        "carousel_assets": [
            "1.webp",
            "2.webp",
            "3.webp",
            "4.webp",
            "5.webp"
        ],
        "base_url": "./apps/SatNOGS_Visualization_Tool/",
        "file": "/app/SatNOGS Visualization Tool_1.0.5.apk",
        "pwa_link": "",
        "type": "app",
        "date": "Mar 28, 2024",
        "android_OS": "4.4W+",
        "version": "1.0.5",
        "content": "View satellites and ground stations information from the SatNOGS database.\nThe project aims to collect and show data from satellites and ground stations using the SatNOGS database and API.\nWith the data available into the app, is possible to send it to the Liquid Galaxy system to be shown into Google Earth.\nAll this information is included in the SatNOGS (Satellite Networked Open Ground Station) database.\nThe ground stations are antennas that capture transmissions from satellites. Using this network, SatNOGS created a database with all the information captured since its creation. We will use this database to get the information we need, since it is open and free. It contains information about the satellites, the data received in the communication, the protocols of transmission accepted and more.\nAn important step to take is configure the slave screens for refreshing, otherwise the logos and the info balloon will not be visible. Follow the steps below to activate it:\n1. With Google Earth opened, press CTRL+ALT+B on the keyboard or click on the VIEW tab on the tab bar and then Sidebar.\n2. Into the Sidebar, expand the KML Sync folder.\n3. Right click on the Solo KML folder and click on Properties.\n4. Go to the Refresh tab and change the Time-Based Refresh to: Periodically | 0hrs | 0mins | 2secs\n- The recommended secs if from 1 to 3 seconds.\n- Click on OK and close the side bar by following the first step.\n\nDone! Remember to do it for all slave screens so all of them will be reactive.\n\nThis project has been started as a Google Summer of Code 2022 project with the Liquid Galaxy Organization, developed by Michel Agarra Barros.\nLleida Liquid Galaxy LAB support: Pau Francino\nLiquid Galaxy Org Director: Andreu Iba침ez\nApp released by Alejandro Ill치n Marcos"
    }
]